In [111]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

Reading in my Homeland Security excel files.

In [113]:
df_07 = pd.read_excel("2007.xlsx")
df_08 = pd.read_excel("2008.xlsx")
df_09 = pd.read_excel("2009.xlsx")
df_10 = pd.read_excel("2010.xlsx")
df_11 = pd.read_excel("2011.xlsx")
df_12 = pd.read_excel("2012.xlsx")
df_13 = pd.read_excel("2013.xlsx")
df_14 = pd.read_excel("2014.xlsx")
df_15 = pd.read_excel("2015.xlsx")
df_16 = pd.read_excel("2016.xlsx")
df_17 = pd.read_excel("2017.xlsx")
df_18 = pd.read_excel("2018.xlsx")
df_19 = pd.read_excel("2019.xlsx")
df_20 = pd.read_excel("2020.xlsx")
df_21 = pd.read_excel("2021.xlsx")
df_22 = pd.read_excel("2022.xlsx")
df_23 = pd.read_excel("2023.xlsx")

In [114]:
df_07.head(2)

,"Table. New Lawful Permanent Residents by State of Residence, County of Residence, Country of Birth, and Major Class of Admission: 2007",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,(Top 200 counties by size of admission only),NaN,NaN,NaN,NaN
1,('D' signifies data withheld to limit disclosure),NaN,NaN,NaN,NaN

In [115]:
df_07 = df_07.drop([0,1,2])

In [116]:
df_07 = df_07.rename(columns=df_07.iloc[0]).drop(df_07.index[0])

In [117]:
df_07['Year'] = 2007
df_07 = df_07.drop(df_07.index[0]).reset_index(drop=True)
df_07.rename(columns={df_07.columns[-1]: 'Year'}, inplace=True)

In [118]:
df_07.head(2)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,19,2007
1,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,11,2007

In [119]:
df_08 = df_08.drop([0,1,2])

In [120]:
df_08 = df_08.rename(columns=df_08.iloc[0]).drop(df_08.index[0])

In [121]:
df_08['Year'] = 2008
df_08 = df_08.drop(df_08.index[0]).reset_index(drop=True)
df_08.rename(columns={df_08.columns[-1]: 'Year'}, inplace=True)

In [122]:
df_08.head(2)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,15,2008
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,25,2008

In [123]:
df_09 = df_09.drop([0,1,2])

In [124]:
df_09 = df_09.rename(columns=df_09.iloc[0]).drop(df_09.index[0])

In [125]:
df_09['Year'] = 2009
df_09 = df_09.drop(df_09.index[0]).reset_index(drop=True)
df_09.rename(columns={df_09.columns[-1]: 'Year'}, inplace=True)

In [126]:
df_09.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,15,2009
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,36,2009
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,4,2009

In [127]:
df_10 = df_10.drop([0,1,2])

In [128]:
df_10 = df_10.rename(columns=df_10.iloc[0]).drop(df_10.index[0])

In [129]:
df_10['Year'] = 2010
df_10 = df_10.drop(df_10.index[0]).reset_index(drop=True)
df_10.rename(columns={df_10.columns[-1]: 'Year'}, inplace=True)

In [130]:
df_10

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,4,2010
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,29,2010
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,9,2010
3,California,Los Angeles,Afghanistan,Family Preference 4th,D,2010
4,California,Los Angeles,Afghanistan,Family Preference 3rd,4,2010
...,...,...,...,...,...,...
80286,Florida,Volusia,Vietnam,Immediate Relatives - Spouses,5,2010
80287,Florida,Volusia,Vietnam,Immediate Relatives - Parents,6,2010
80288,Florida,Volusia,Vietnam,Family Preference 4th,D,2010
80289,Florida,Volusia,Vietnam,Family Preference 2nd,5,2010
80290,Florida,Volusia,Zambia,Employment Preference 3rd Skilled,D,2010

In [131]:
df_11 = df_11.drop([0,1,2])

In [132]:
df_11= df_11.rename(columns=df_11.iloc[0]).drop(df_11.index[0])

In [133]:
df_11['Year'] = 2011
df_11 = df_11.drop(df_11.index[0]).reset_index(drop=True)
df_11.rename(columns={df_11.columns[-1]: 'Year'}, inplace=True)

In [134]:
df_11

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,4,2011
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,20,2011
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2011
3,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,D,2011
4,California,Los Angeles,Afghanistan,Family Preference 3rd,5,2011
...,...,...,...,...,...,...
79354,New York,Oneida,Vietnam,Immediate Relatives - Children,D,2011
79355,New York,Oneida,Vietnam,Immediate Relatives - Parents,D,2011
79356,New York,Oneida,Vietnam,Family Preference 2nd,5,2011
79357,New York,Oneida,Yemen,Immediate Relatives - Spouses,D,2011
79358,New York,Oneida,Yemen,Immediate Relatives - Children,6,2011

In [135]:
df_12 = df_12.drop([0,1,2])

In [136]:
df_12= df_12.rename(columns=df_12.iloc[0]).drop(df_12.index[0])

In [137]:
df_12['Year'] = 2012
df_12 = df_12.drop(df_12.index[0]).reset_index(drop=True)
df_12.rename(columns={df_12.columns[-1]: 'Year'}, inplace=True)

In [138]:
df_12.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,7,2012
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,21,2012
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,15,2012

In [139]:
df_13 = df_13.drop([0,1,2])

In [140]:
df_13= df_13.rename(columns=df_13.iloc[0]).drop(df_13.index[0])

In [141]:
df_13['Year'] = 2013
df_13 = df_13.drop(df_13.index[0]).reset_index(drop=True)
df_13.rename(columns={df_13.columns[-1]: 'Year'}, inplace=True)

In [142]:
df_13.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,10,2013
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,20,2013
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2013

In [143]:
df_14 = df_14.drop([0,1,2])

In [144]:
df_14= df_14.rename(columns=df_14.iloc[0]).drop(df_14.index[0])

In [145]:
df_14['Year'] = 2014
df_14 = df_14.drop(df_14.index[0]).reset_index(drop=True)
df_14.rename(columns={df_14.columns[-1]: 'Year'}, inplace=True)

In [146]:
df_14.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,182,2014
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,18,2014
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,4,2014

In [147]:
df_15 = df_15.drop([0,1,2])

In [148]:
df_15= df_15.rename(columns=df_15.iloc[0]).drop(df_15.index[0])

In [149]:
df_15['Year'] = 2015
df_15 = df_15.drop(df_15.index[0]).reset_index(drop=True)
df_15.rename(columns={df_15.columns[-1]: 'Year'}, inplace=True)

In [150]:
df_15.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,132,2015
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,23,2015
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2015

In [151]:
df_16 = df_16.drop([0,1,2])

In [152]:
df_16= df_16.rename(columns=df_16.iloc[0]).drop(df_16.index[0])

In [153]:
df_16['Year'] = 2016
df_16 = df_16.drop(df_16.index[0]).reset_index(drop=True)
df_16.rename(columns={df_16.columns[-1]: 'Year'}, inplace=True)

In [154]:
df_16.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Family Preference 2nd,19,2016
1,California,Los Angeles,Afghanistan,Family Preference 3rd,D,2016
2,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,16,2016

In [155]:
df_17 = df_17.drop([0,1,2])

In [156]:
df_17= df_17.rename(columns=df_17.iloc[0]).drop(df_17.index[0])

In [157]:
df_17['Year'] = 2017
df_17 = df_17.drop(df_17.index[0]).reset_index(drop=True)
df_17.rename(columns={df_17.columns[-1]: 'Year'}, inplace=True)

In [158]:
df_17.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,408,2017
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,13,2017
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2017

In [159]:
df_18 = df_18.drop([0,1,2])

In [160]:
df_18= df_18.rename(columns=df_18.iloc[0]).drop(df_18.index[0])

In [161]:
df_18['Year'] = 2018
df_18 = df_18.drop(df_18.index[0]).reset_index(drop=True)
df_18.rename(columns={df_18.columns[-1]: 'Year'}, inplace=True)

In [162]:
df_18.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Other,234,2018
1,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,6,2018
2,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,6,2018

In [163]:
df_19 = df_19.drop([0,1,2])

In [164]:
df_19= df_19.rename(columns=df_19.iloc[0]).drop(df_19.index[0])

In [165]:
df_19['Year'] = 2019
df_19 = df_19.drop(df_19.index[0]).reset_index(drop=True)
df_19.rename(columns={df_19.columns[-1]: 'Year'}, inplace=True)

In [166]:
df_19.head(3)

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Family Preference 2nd,9,2019
1,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,9,2019
2,California,Los Angeles,Afghanistan,Immediate Relatives - Children,D,2019

In [167]:
df_20 =df_20.rename(columns=df_20.iloc[1]).drop(df_20.index[:2])

In [168]:
df_20['Year'] = 2020
df_20 = df_20.reset_index(drop=True)
df_20.rename(columns={df_20.columns[-1]: 'Year'}, inplace=True)

In [169]:
df_20.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,D,2020
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Children,D,2020
2,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,D,2020
3,Arizona,Maricopa,Afghanistan,Family Preference 2nd,D,2020
4,Arizona,Maricopa,Afghanistan,Diversity Program,4,2020

In [170]:
df_21 =df_21.rename(columns=df_21.iloc[1]).drop(df_21.index[:2])

In [171]:
df_21['Year'] = 2021
df_21 = df_21.reset_index(drop=True)
df_21.rename(columns={df_21.columns[-1]: 'Year'}, inplace=True)

In [172]:
df_21.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Alabama,Jefferson,Albania,Diversity Program,D,2021
1,Alabama,Jefferson,Algeria,Immediate Relatives - Spouses,D,2021
2,Alabama,Jefferson,Argentina,Immediate Relatives - Spouses,D,2021
3,Alabama,Jefferson,Argentina,Immediate Relatives - Children,D,2021
4,Alabama,Jefferson,Australia,Immediate Relatives - Spouses,4,2021

In [173]:
df_22 =df_22.rename(columns=df_22.iloc[1]).drop(df_22.index[:2])

In [174]:
df_22['Year'] = 2022
df_22 = df_22.reset_index(drop=True)
df_22.rename(columns={df_22.columns[-1]: 'Year'}, inplace=True)

In [175]:
df_22.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,10,2022
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,D,2022
2,Arizona,Maricopa,Afghanistan,Family Preference 2nd,D,2022
3,Arizona,Maricopa,Afghanistan,Refugee and Asylee Adjustments,21,2022
4,Arizona,Maricopa,Afghanistan,Other,108,2022

In [176]:
df_23 =df_23.rename(columns=df_23.iloc[1]).drop(df_23.index[:2])

In [177]:
df_23['Year'] = 2023
df_23 = df_23.reset_index(drop=True)
df_23.rename(columns={df_23.columns[-1]: 'Year'}, inplace=True)

In [178]:
df_23.head()

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,Arizona,Maricopa,Afghanistan,Immediate Relatives - Spouses,20,2023
1,Arizona,Maricopa,Afghanistan,Immediate Relatives - Children,0,2023
2,Arizona,Maricopa,Afghanistan,Immediate Relatives - Parents,10,2023
3,Arizona,Maricopa,Afghanistan,Family Preference 2nd,0,2023
4,Arizona,Maricopa,Afghanistan,Family Preference 3rd,0,2023

Creating my master dataframe where i will filter for what i need.

In [179]:
allfiles = [df_07, df_08, df_09, df_10, df_11, df_12, df_13, df_14, df_15, df_16, df_17, df_18, df_19, df_20, df_21, df_22, df_23]

In [180]:
master_df = pd.concat(allfiles, ignore_index =True)

In [181]:
master_df

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
0,California,Los Angeles,Afghanistan,Immediate Relatives - Spouses,19,2007
1,California,Los Angeles,Afghanistan,Immediate Relatives - Parents,11,2007
2,California,Los Angeles,Afghanistan,Family Preference 3rd,D,2007
3,California,Los Angeles,Afghanistan,Family Preference 2nd,D,2007
4,California,Los Angeles,Afghanistan,Family Preference 1st,D,2007
...,...,...,...,...,...,...
1344501,Wisconsin,Milwaukee,Yemen,Immediate Relatives - Spouses,0,2023
1344502,Wisconsin,Milwaukee,Zambia,Immediate Relatives - Spouses,0,2023
1344503,Wisconsin,Milwaukee,Zimbabwe,Employment Preference 2nd,10,2023
1344504,"Notes: To protect privacy, we round table cell...",NaN,NaN,NaN,NaN,2023
1344505,Source: Office of Homeland Security Statistics.,NaN,NaN,NaN,NaN,2023

In [185]:
sudan_df = master_df[(master_df['Country of Birth'] == 'Sudan') | (master_df['Country of Birth'] == 'South Sudan')].copy()

In [201]:
sudan_df

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year
1113,California,Los Angeles,Sudan,Refugee and Asylee Adjustments,27,2007
1114,California,Los Angeles,Sudan,Immediate Relatives - Spouses,D,2007
1115,California,Los Angeles,Sudan,Immediate Relatives - Parents,D,2007
1116,California,Los Angeles,Sudan,Employment Preference 4th,D,2007
1117,California,Los Angeles,Sudan,Diversity Program,D,2007
...,...,...,...,...,...,...
1344443,Wisconsin,Milwaukee,Sudan,Family Preference 1st,0,2023
1344444,Wisconsin,Milwaukee,Sudan,Family Preference 2nd,0,2023
1344445,Wisconsin,Milwaukee,Sudan,Family Preference 4th,0,2023
1344446,Wisconsin,Milwaukee,Sudan,Diversity Program,10,2023
1344447,Wisconsin,Milwaukee,Sudan,Refugee and Asylee Adjustments,0,2023

In [202]:
sudan_df['Admission_no'] = sudan_df['Admissions'].astype(str).str.strip().str.replace(',', '')

In [203]:
sudan_df['Admission_no'] = pd.to_numeric(sudan_df['Admission_no'].replace('D',''), errors= 'coerce')

In [204]:
sudan_df['Admissions_1'] = pd.to_numeric(sudan_df['Admissions'].astype(str).str.strip().str.replace(',', '').replace('D', '1'), errors='coerce')

In [205]:
sudan_df

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year,Admission_no,Admissions_1
1113,California,Los Angeles,Sudan,Refugee and Asylee Adjustments,27,2007,27.0,27
1114,California,Los Angeles,Sudan,Immediate Relatives - Spouses,D,2007,NaN,1
1115,California,Los Angeles,Sudan,Immediate Relatives - Parents,D,2007,NaN,1
1116,California,Los Angeles,Sudan,Employment Preference 4th,D,2007,NaN,1
1117,California,Los Angeles,Sudan,Diversity Program,D,2007,NaN,1
...,...,...,...,...,...,...,...,...
1344443,Wisconsin,Milwaukee,Sudan,Family Preference 1st,0,2023,0.0,0
1344444,Wisconsin,Milwaukee,Sudan,Family Preference 2nd,0,2023,0.0,0
1344445,Wisconsin,Milwaukee,Sudan,Family Preference 4th,0,2023,0.0,0
1344446,Wisconsin,Milwaukee,Sudan,Diversity Program,10,2023,10.0,10
1344447,Wisconsin,Milwaukee,Sudan,Refugee and Asylee Adjustments,0,2023,0.0,0

What are the different classifications Sudanese are entering into the United States to understanding their need for displacement.

In [210]:
classification = sudan_df.groupby('Major Class of Admission')['Admissions_1'].sum().sort_values(ascending = False)

In [211]:
classification

Major Class of Admission
Refugee and Asylee Adjustments         15229
Diversity Program                       9874
Immediate Relatives - Spouses           4261
Immediate Relatives -  Parents          1573
Immediate Relatives - Children          1295
Family Preference 2nd                    682
Immediate Relatives - Parents            207
Employment Preference 2nd                147
Family Preference 4th                    144
Employment Preference 4th                123
Family Preference 1st                     79
Employment Preference 1st                 57
Employment Preference 3rd Skilled         54
Family Preference 3rd                     37
Other                                     29
Employment Preference 5th                 11
Employment Preference 3rd Unskilled        1
Name: Admissions_1, dtype: int64

Top 10 States to where Sudanese are first settling in the United States.

In [347]:
top10sudan_df = sudan_df.groupby('State of Residence')['Admissions_1'].sum().sort_values(ascending=False).head(10)

In [348]:
top10sudan_df

State of Residence
Virginia          3593
Texas             3570
New York          2846
California        2009
North Carolina    2006
Arizona           1597
Pennsylvania      1478
Colorado          1389
Maryland          1252
Nebraska          1244
Name: Admissions_1, dtype: int64

Within those state, which counties are more prevelent for Sudanese?

In [215]:
topcounty = sudan_df.groupby(['State of Residence', 'County of Residence'])['Admissions_1'].sum().sort_values(ascending=False).head(5)

In [216]:
topcounty

State of Residence  County of Residence
Virginia            Fairfax                2045
North Carolina      Guilford               1466
New York            Kings                  1221
Arizona             Maricopa               1112
Texas               Tarrant                1075
Name: Admissions_1, dtype: int64

In [349]:
topstate = sudan_df.groupby(['State of Residence', 'State of Residence'])['Admissions_1'].sum().sort_values(
                                                                                                ascending=False).head(10)

A count for all admissions that unaccounted for == D.

In [219]:
total_rows = len(sudan_df)

In [220]:
total_rows

7745

In [221]:
rows = (unaccounted /total_rows) * 100

NameError: name 'unaccounted' is not defined

In [222]:
unaccounted = (sudan_df['Admissions'].astype(str).str.strip() == 'D').sum()

In [223]:
display(unaccounted)

np.int64(4943)

Total for all admissions changing all uncaccounted values for 0.

In [224]:
unaccounted0 = sudan_df['Admission_no'].sum()

In [225]:
unaccounted0

np.float64(28860.0)

Total for all admissions changing all uncaccounted values for 1.

In [226]:
unaccounted1 = sudan_df['Admissions_1'].sum()

In [227]:
unaccounted1

np.int64(33803)

Percentage of the unaccounted data

In [229]:
unaccounted0 / unaccounted

np.float64(5.838559579202913)

In [230]:
unaccounted1 / unaccounted

np.float64(6.838559579202913)

Using the master dataframe to see Sudan/South Sudan compared to neighboring countries.

In [231]:
east =master_df[(master_df['Country of Birth'] == 'Sudan')  | (master_df['Country of Birth'] == 'South Sudan') | 
(master_df['Country of Birth'] == 'Ethiopia') | (master_df['Country of Birth'] == 'Kenya') | (master_df['Country of Birth'] == 'Somalia') |
(master_df['Country of Birth'] == 'Eritrea') | (master_df['Country of Birth'] == 'Egypt') | (master_df['Country of Birth'] == 'Uganda')]

In [395]:
east

,State of Residence,County of Residence,Country of Birth,Major Class of Admission,Admissions,Year,Admissions_1
334,California,Los Angeles,Egypt,Immediate Relatives - Spouses,77,2007,77
335,California,Los Angeles,Egypt,Immediate Relatives - Children,18,2007,18
336,California,Los Angeles,Egypt,Immediate Relatives - Parents,57,2007,57
337,California,Los Angeles,Egypt,Refugee and Asylee Adjustments,132,2007,132
338,California,Los Angeles,Egypt,Family Preference 4th,37,2007,37
...,...,...,...,...,...,...,...
1344446,Wisconsin,Milwaukee,Sudan,Diversity Program,10,2023,10
1344447,Wisconsin,Milwaukee,Sudan,Refugee and Asylee Adjustments,0,2023,0
1344469,Wisconsin,Milwaukee,Uganda,Immediate Relatives - Spouses,0,2023,0
1344470,Wisconsin,Milwaukee,Uganda,Employment Preference 2nd,0,2023,0
1344471,Wisconsin,Milwaukee,Uganda,Refugee and Asylee Adjustments,0,2023,0

In [233]:
east['Admissions_1'] = pd.to_numeric(east['Admissions'].astype(str).str.strip().str.replace(',', '').replace('D', '1'), errors='coerce')

C:\Users\Meve\AppData\Local\Temp\ipykernel_23252\2919167637.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  east['Admissions_1'] = pd.to_numeric(east['Admissions'].astype(str).str.strip().str.replace(',', '').replace('D', '1'), errors='coerce')

In [397]:
east.to_csv('eastdata.csv', index=False)

In [239]:
yearlytrend = east.pivot_table(index='Year', columns='Country of Birth', values='Admissions_1', aggfunc='sum')

In [240]:
yearlytrend

Country of Birth,Egypt,Eritrea,Ethiopia,Kenya,Somalia,South Sudan,Sudan,Uganda
Year,,,,,,,,
2007,7899.0,926.0,11323.0,5432.0,5161.0,NaN,2135.0,826.0
2008,7355.0,1060.0,11118.0,5401.0,8596.0,NaN,2568.0,842.0
2009,7393.0,1621.0,13148.0,7644.0,10033.0,NaN,2603.0,997.0
2010,7548.0,1390.0,11987.0,5694.0,3300.0,NaN,1755.0,777.0
2011,6498.0,1807.0,11865.0,5768.0,3104.0,NaN,1972.0,822.0
2012,7606.0,2246.0,12417.0,5108.0,3595.0,12.0,1843.0,898.0
2013,8828.0,1777.0,11092.0,4447.0,2421.0,34.0,1372.0,871.0
2014,9899.0,1552.0,10396.0,4136.0,3325.0,46.0,1773.0,913.0
2015,10468.0,1786.0,9657.0,4029.0,4340.0,71.0,2612.0,1099.0
2016,10170.0,1822.0,11244.0,4501.0,4494.0,59.0,2278.0,1140.0
2017,8155.0,1968.0,12685.0,5113.0,5298.0,81.0,2700.0,1387.0
2018,8125.0,1960.0,10637.0,5237.0,5419.0,105.0,2721.0,1899.0
2019,7875.0,1980.0,7683.0,4881.0,2484.0,109.0,2010.0,1854.0
2020,4958.0,1505.0,5258.0,2737.0,1360.0,63.0,1316.0,1271.0
2021,3416.0,1032.0,3055.0,2113.0,661.0,34.0,558.0,786.0
2022,6898.0,1425.0,4828.0,3570.0,704.0,51.0,922.0,1177.0
2023,8260.0,1080.0,5450.0,3380.0,800.0,30.0,1970.0,1050.0

In [241]:
yearlytrend.to_csv('yearlytrend.csv', index=False)

In [243]:
yearlytrend['Year'] = list(range(2007, 2024))

In [244]:
newyrtrend = yearlytrend.melt(id_vars=['Year'], var_name='Country', value_name='Admissions')

In [245]:
newyrtrend

     Year Country  Admissions
0    2007   Egypt      7899.0
1    2008   Egypt      7355.0
2    2009   Egypt      7393.0
3    2010   Egypt      7548.0
4    2011   Egypt      6498.0
..    ...     ...         ...
131  2019  Uganda      1854.0
132  2020  Uganda      1271.0
133  2021  Uganda       786.0
134  2022  Uganda      1177.0
135  2023  Uganda      1050.0

[136 rows x 3 columns]

In [247]:
newyrtrend.to_csv('eastafcomp.csv', index=False)

Pulling in the Census dataset and cleaning it for my use.

In [17]:
pocd = pd.read_csv("persons_of_concern_demographics.csv")

In [394]:
pocd

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,...,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total,Total Children,Total Adults,Child %
0,2001,Egypt,Sudan,EGY,SDN,302,331,283,1035,38,...,393,336,1571,32,7624,10294,15952,1983,2676,42.562782
1,2001,United States of America,Sudan,USA,SDN,0,0,0,0,0,...,0,0,0,0,0,0,16918,0,0,NaN
2,2002,Egypt,Sudan,EGY,SDN,477,473,405,1702,42,...,556,476,2910,40,0,4530,15033,2935,4694,38.471621
3,2002,United States of America,Sudan,USA,SDN,0,0,0,0,0,...,0,0,0,0,0,0,17679,0,0,NaN
4,2003,Egypt,Sudan,EGY,SDN,765,746,640,2914,63,...,868,744,6455,67,0,9050,16551,4679,9499,33.001834
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69,2022,United States of America,South Sudan,USA,SSD,0,0,0,9,0,...,0,0,15,0,0,15,143,0,24,0.000000
70,2023,Egypt,South Sudan,EGY,SSD,2262,3151,2576,11088,328,...,3384,2414,10221,112,0,18510,37915,16166,21749,42.637479
71,2023,United States of America,South Sudan,USA,SSD,0,0,0,0,0,...,0,0,0,0,0,0,242,0,0,NaN
72,2024,Egypt,South Sudan,EGY,SSD,2745,4062,3407,13671,437,...,4286,3191,11302,153,0,21841,46163,20600,25563,44.624483
73,2024,United States of America,South Sudan,USA,SSD,0,0,0,0,0,...,0,0,0,0,0,0,293,0,0,NaN

In [312]:
cdf= pd.read_csv("census_df.csv")

In [388]:
cdf

,Country,United States,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming,Puerto Rico
107,Sudan,"52,267",NaN,NaN,864,NaN,"1,920","3,199","1,087",NaN,...,"3,948","6,246","1,340",NaN,"3,220","1,938",NaN,540,NaN,NaN
105,Egypt,"219,749",NaN,NaN,"3,590",NaN,"44,180","2,143",980,NaN,...,"9,883","12,421",0,NaN,"9,080","2,447",NaN,"1,316",NaN,NaN
96,Uganda,"28,946",NaN,NaN,350,NaN,"4,530",596,505,NaN,...,128,"2,583",71,NaN,"1,325","1,572",NaN,172,NaN,NaN
93,Ethiopia,"271,847",NaN,NaN,"4,699",NaN,"25,266","9,978",878,NaN,...,"3,518","26,474",537,NaN,"28,161","14,871",NaN,"1,090",NaN,NaN
95,Somalia,"97,695",NaN,NaN,519,NaN,"3,460","1,236",57,NaN,...,"1,141","3,612",576,NaN,"2,307","10,375",NaN,943,NaN,NaN
94,Kenya,"154,062",NaN,NaN,"4,209",NaN,"9,132","1,339",552,NaN,...,"1,548","26,698",195,NaN,"3,966","13,248",NaN,147,NaN,NaN
92,Eritrea,"47,449",NaN,NaN,"1,901",NaN,"6,690","1,882",75,NaN,...,429,"5,179",0,NaN,"3,601","3,657",NaN,0,NaN,NaN

In [320]:
countries_code = [107, 105, 96, 93, 95, 94, 92]

In [306]:
countries = ['Sudan107', 'Ethiopia93', 'Kenya94', 'Somalia95', 'Eritrea92', 'Uganda96', 'Egpyt105']

In [329]:
cdf = dfc.iloc[countries_code].copy()

In [330]:
cdf

,Label (Grouping),United States!!Estimate,Alabama!!Estimate,Alaska!!Estimate,Arizona!!Estimate,Arkansas!!Estimate,California!!Estimate,Colorado!!Estimate,Connecticut!!Estimate,Delaware!!Estimate,...,Tennessee!!Estimate,Texas!!Estimate,Utah!!Estimate,Vermont!!Estimate,Virginia!!Estimate,Washington!!Estimate,West Virginia!!Estimate,Wisconsin!!Estimate,Wyoming!!Estimate,Puerto Rico!!Estimate
107,Sudan,"52,267",NaN,NaN,864,NaN,"1,920","3,199","1,087",NaN,...,"3,948","6,246","1,340",NaN,"3,220","1,938",NaN,540,NaN,NaN
105,Egypt,"219,749",NaN,NaN,"3,590",NaN,"44,180","2,143",980,NaN,...,"9,883","12,421",0,NaN,"9,080","2,447",NaN,"1,316",NaN,NaN
96,Uganda,"28,946",NaN,NaN,350,NaN,"4,530",596,505,NaN,...,128,"2,583",71,NaN,"1,325","1,572",NaN,172,NaN,NaN
93,Ethiopia,"271,847",NaN,NaN,"4,699",NaN,"25,266","9,978",878,NaN,...,"3,518","26,474",537,NaN,"28,161","14,871",NaN,"1,090",NaN,NaN
95,Somalia,"97,695",NaN,NaN,519,NaN,"3,460","1,236",57,NaN,...,"1,141","3,612",576,NaN,"2,307","10,375",NaN,943,NaN,NaN
94,Kenya,"154,062",NaN,NaN,"4,209",NaN,"9,132","1,339",552,NaN,...,"1,548","26,698",195,NaN,"3,966","13,248",NaN,147,NaN,NaN
92,Eritrea,"47,449",NaN,NaN,"1,901",NaN,"6,690","1,882",75,NaN,...,429,"5,179",0,NaN,"3,601","3,657",NaN,0,NaN,NaN

In [331]:
cdf.columns = cdf.columns.str.replace('!!Estimate', '')

In [332]:
cdf.rename(columns={cdf.columns[0]: 'Country'}, inplace=True)

In [333]:
cdf['Country'] = cdf['Country'].str.strip()

In [334]:
cdf_clean = cdf.melt(id_vars=['Country'], var_name='State', value_name='Population')

In [335]:
cdf_clean['Population'] = (
    cdf_clean['Population']
    .astype(str)
    .str.replace(',', '', regex=False)    
    .pipe(pd.to_numeric, errors='coerce') 
    .fillna(0)                            
    .astype(int)                          
)

In [336]:
cdf_fin = cdf_clean[cdf_clean['State'] != 'United States']

In [375]:
cdf_fin = cdf_fin.copy()

In [376]:
countrytots = cdf_fin.groupby('Country')['Population'].transform('sum')

In [379]:
cdf_fin['Country Total %'] = (cdf_fin['Population'] / countrytots) * 100

In [381]:
statetots = cdf_fin.groupby('State')['Population'].transform('sum')

In [383]:
cdf_fin['State Total %'] = (cdf_fin['Population'] / statetots) * 100

In [384]:
cdf_fin

      Country        State  Population  Country Total %  State Total %
7       Sudan      Alabama           0              0.0            NaN
8       Egypt      Alabama           0              0.0            NaN
9      Uganda      Alabama           0              0.0            NaN
10   Ethiopia      Alabama           0              0.0            NaN
11    Somalia      Alabama           0              0.0            NaN
..        ...          ...         ...              ...            ...
366    Uganda  Puerto Rico           0              0.0            NaN
367  Ethiopia  Puerto Rico           0              0.0            NaN
368   Somalia  Puerto Rico           0              0.0            NaN
369     Kenya  Puerto Rico           0              0.0            NaN
370   Eritrea  Puerto Rico           0              0.0            NaN

[364 rows x 5 columns]

In [385]:
cdf_fin.groupby('State')['State Total %'].sum()

State
Alabama                   0.0
Alaska                    0.0
Arizona                 100.0
Arkansas                  0.0
California              100.0
Colorado                100.0
Connecticut             100.0
Delaware                  0.0
District of Columbia      0.0
Florida                 100.0
Georgia                 100.0
Hawaii                    0.0
Idaho                     0.0
Illinois                100.0
Indiana                 100.0
Iowa                      0.0
Kansas                    0.0
Kentucky                100.0
Louisiana                 0.0
Maine                     0.0
Maryland                100.0
Massachusetts           100.0
Michigan                100.0
Minnesota               100.0
Mississippi               0.0
Missouri                100.0
Montana                   0.0
Nebraska                  0.0
Nevada                  100.0
New Hampshire             0.0
New Jersey              100.0
New Mexico                0.0
New York                100.0
North Carolina          100.0
North Dakota              0.0
Ohio                    100.0
Oklahoma                100.0
Oregon                  100.0
Pennsylvania            100.0
Puerto Rico               0.0
Rhode Island              0.0
South Carolina          100.0
South Dakota              0.0
Tennessee               100.0
Texas                   100.0
Utah                    100.0
Vermont                   0.0
Virginia                100.0
Washington              100.0
West Virginia             0.0
Wisconsin               100.0
Wyoming                   0.0
Name: State Total %, dtype: float64

In [386]:
cdf_fin.to_csv('cdfperc.csv', index=False)

Demographics

In [19]:
pocd

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,Female Other,Female Total,Male 0 - 4,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total
0,2001,Egypt,Sudan,EGY,SDN,302,331,283,1035,38,3669,5658,338,393,336,1571,32,7624,10294,15952
1,2001,United States of America,Sudan,USA,SDN,0,0,0,0,0,0,0,0,0,0,0,0,0,0,16918
2,2002,Egypt,Sudan,EGY,SDN,477,473,405,1702,42,0,3099,548,556,476,2910,40,0,4530,15033
3,2002,United States of America,Sudan,USA,SDN,0,0,0,0,0,0,0,0,0,0,0,0,0,0,17679
4,2003,Egypt,Sudan,EGY,SDN,765,746,640,2914,63,0,5128,916,868,744,6455,67,0,9050,16551
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
69,2022,United States of America,South Sudan,USA,SSD,0,0,0,9,0,0,9,0,0,0,15,0,0,15,143
70,2023,Egypt,South Sudan,EGY,SSD,2262,3151,2576,11088,328,0,19405,2379,3384,2414,10221,112,0,18510,37915
71,2023,United States of America,South Sudan,USA,SSD,0,0,0,0,0,0,0,0,0,0,0,0,0,0,242
72,2024,Egypt,South Sudan,EGY,SSD,2745,4062,3407,13671,437,0,24322,2909,4286,3191,11302,153,0,21841,46163
73,2024,United States of America,South Sudan,USA,SSD,0,0,0,0,0,0,0,0,0,0,0,0,0,0,293

The different countries of origin

In [28]:
pocd['Country of Origin'].unique()

array(['Sudan', 'South Sudan'], dtype=object)

The different countries of asylum

In [29]:
pocd['Country of Asylum'].unique()

array(['Egypt', 'United States of America'], dtype=object)

The date range in the data.

In [30]:
pocd['Year'].max()

2024

In [31]:
pocd['Year'].min()

2001

The difference in number if asylees split between those who are in transit in Eqgypt and those who have transitioned to 
the United States of America.

In [370]:
assumm = pocd.groupby(['Year', 'Country of Asylum'])['Total'].sum().reset_index()

In [371]:
assumm

    Year         Country of Asylum   Total
0   2001                     Egypt   15952
1   2001  United States of America   16918
2   2002                     Egypt   15033
3   2002  United States of America   17679
4   2003                     Egypt   16551
5   2003  United States of America   17654
6   2004                     Egypt   23026
7   2004  United States of America   18248
8   2005                     Egypt   23637
9   2005  United States of America   16533
10  2006                     Egypt   24678
11  2006  United States of America   28280
12  2007                     Egypt   23725
13  2007  United States of America    3875
14  2008                     Egypt   23283
15  2008  United States of America    3448
16  2009                     Egypt   21802
17  2009  United States of America    3028
18  2010                     Egypt   22511
19  2010  United States of America    2377
20  2011                     Egypt   24750
21  2011  United States of America    1910
22  2012                     Egypt   23730
23  2012  United States of America    1512
24  2013                     Egypt   28232
25  2013  United States of America    1551
26  2014                     Egypt   29736
27  2014  United States of America    1717
28  2015                     Egypt   32759
29  2015  United States of America    1900
30  2016                     Egypt   38769
31  2016  United States of America    2139
32  2017                     Egypt   45812
33  2017  United States of America    2320
34  2018                     Egypt   56393
35  2018  United States of America    2352
36  2019                     Egypt   66776
37  2019  United States of America    2362
38  2020                     Egypt   69054
39  2020  United States of America    2393
40  2021                     Egypt   72716
41  2021  United States of America    2754
42  2022                     Egypt   82583
43  2022  United States of America    2693
44  2023                     Egypt  245748
45  2023  United States of America    3416
46  2024                     Egypt  648865
47  2024  United States of America    4523

In [372]:
assumm.to_csv('assum.csv', index=False)

In [38]:
#### insert a plot here

With the spliot of the country, it is important to see the shift of new immigrations statuses.

In [40]:
countrysplit = pocd.groupby(['Year', 'Country of Origin'])['Total'].sum()

In [41]:
countrysplit

Year  Country of Origin
2001  Sudan                 32870
2002  Sudan                 32712
2003  Sudan                 34205
2004  Sudan                 41274
2005  Sudan                 40170
2006  Sudan                 52958
2007  Sudan                 27600
2008  Sudan                 26731
2009  Sudan                 24830
2010  Sudan                 24888
2011  Sudan                 26660
2012  South Sudan             947
      Sudan                 24295
2013  South Sudan            1822
      Sudan                 27961
2014  South Sudan            3014
      Sudan                 28439
2015  South Sudan            4162
      Sudan                 30497
2016  South Sudan            5658
      Sudan                 35250
2017  South Sudan           10110
      Sudan                 38022
2018  South Sudan           14680
      Sudan                 44065
2019  South Sudan           19095
      Sudan                 50043
2020  South Sudan           19910
      Sudan                 51537
2021  South Sudan           20838
      Sudan                 54632
2022  South Sudan           24489
      Sudan                 60787
2023  South Sudan           38157
      Sudan                211007
2024  South Sudan           46456
      Sudan                606932
Name: Total, dtype: int64

Looking at the migratio patterns of South Sudan and Sudan across the years.

In [43]:
egpytasylum = pocd[(pocd['Country of Asylum'] == 'Egpyt') | (pocd['Year'] == 2024)]

In [45]:
egpytasylum

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,Female Other,Female Total,Male 0 - 4,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total
46,2024,Egypt,Sudan,EGY,SDN,26840,49446,43429,183381,23385,0,326481,27493,51224,44530,131737,21237,0,276221,602702
47,2024,United States of America,Sudan,USA,SDN,0,0,0,0,0,0,0,0,0,0,0,0,0,0,4230
72,2024,Egypt,South Sudan,EGY,SSD,2745,4062,3407,13671,437,0,24322,2909,4286,3191,11302,153,0,21841,46163
73,2024,United States of America,South Sudan,USA,SSD,0,0,0,0,0,0,0,0,0,0,0,0,0,0,293

In [56]:
compare = egpytasylum.groupby('Country of Origin').sum()

In [57]:
compare

,Year,Country of Asylum,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,Female Other,Female Total,Male 0 - 4,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total
Country of Origin,,,,,,,,,,,,,,,,,,,
South Sudan,4048,EgyptUnited States of America,EGYUSA,SSDSSD,2745,4062,3407,13671,437,0,24322,2909,4286,3191,11302,153,0,21841,46456
Sudan,4048,EgyptUnited States of America,EGYUSA,SDNSDN,26840,49446,43429,183381,23385,0,326481,27493,51224,44530,131737,21237,0,276221,606932

In [54]:
egpytasylum.columns.tolist()

['Year',
 'Country of Asylum',
 'Country of Origin',
 'Country of Asylum ISO',
 'Country of Origin ISO',
 'Female 0 - 4',
 'Female 5 - 11',
 'Female 12 - 17',
 'Female 18 - 59',
 'Female 60+',
 'Female Other',
 'Female Total',
 'Male 0 - 4',
 'Male 5 - 11',
 'Male 12 - 17',
 'Male 18 - 59',
 'Male 60+',
 'Male Other',
 'Male Total',
 'Total']

In [55]:
childgroups = ['Female 0 - 4', 'Female 5 - 11', 'Female 12 - 17', 'Male 0 - 4', 'Male 5 - 11', 'Male 12 - 17']
adultgroups = ['Female 18 - 59', 'Female 60+', 'Male 18 - 59', 'Male 60+']

In [60]:
skids = compare.loc['Sudan', childgroups].sum()
sadults = compare.loc['Sudan', childgroups].sum()

In [61]:
sskids = compare.loc['South Sudan', childgroups].sum()
ssadults = compare.loc['South Sudan', childgroups].sum()

In [65]:
print("Sudan Kids:", skids)
print("Sudan adults:", sadults)
print("South Sudan kids:", sskids)
print("Sudan Sudan:", ssadults)

Sudan Kids: 242962
Sudan adults: 242962
South Sudan kids: 20600
Sudan Sudan: 20600

In [ ]:
#### Plot these comparisons: bar graphs would be good

Total comparison of them genders for sudan and south sudan in the year 2024.

In [70]:
gendertotal = egpytasylum.groupby('Country of Origin').agg({'Female Total': 'sum', 'Male Total': 'sum', 'Total': 'sum'})

In [80]:
gendertotal

                   Female Total  Male Total   Total
Country of Origin
South Sudan               24322       21841   46456
Sudan                    326481      276221  606932

In [84]:
gendertotal['Children'] = egpytasylum.groupby('Country of Origin')[childgroups].sum().sum(axis=1)

In [85]:
gendertotal['Adult'] = egpytasylum.groupby('Country of Origin')[adultgroups].sum().sum(axis=1)

In [88]:
gendertotal

,Female Total,Male Total,Total,Children,Adult,Child %
Country of Origin,,,,,,
South Sudan,24322,21841,46456,20600,25563,44.343034
Sudan,326481,276221,606932,242962,359740,40.031173

Percantage of the gender and age totals.

In [87]:
gendertotal['Child %'] = (gendertotal['Children'] / gendertotal['Total']) * 100

In [90]:
gendertotal['Adult %'] = (gendertotal['Adult'] / gendertotal['Total']) * 100

In [91]:
gendertotal['Male %'] = (gendertotal['Male Total'] / gendertotal['Total']) * 100

In [92]:
gendertotal['Female %'] = (gendertotal['Female Total'] / gendertotal['Total']) * 100

In [93]:
gendertotal

,Female Total,Male Total,Total,Children,Adult,Child %,Adult %,Male %,Female %
Country of Origin,,,,,,,,,
South Sudan,24322,21841,46456,20600,25563,44.343034,55.026261,47.014379,52.354916
Sudan,326481,276221,606932,242962,359740,40.031173,59.271879,45.511029,53.792023

In [198]:
gendertotal.to_csv('gender.csv', index=False)

In [100]:
egyptoverall = pocd[pocd['Country of Asylum'] == 'Egypt'].copy()

In [364]:
egyptoverall.head()

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,...,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total,Total Children,Total Adults,Child %
0,2001,Egypt,Sudan,EGY,SDN,302,331,283,1035,38,...,393,336,1571,32,7624,10294,15952,1983,2676,42.562782
2,2002,Egypt,Sudan,EGY,SDN,477,473,405,1702,42,...,556,476,2910,40,0,4530,15033,2935,4694,38.471621
4,2003,Egypt,Sudan,EGY,SDN,765,746,640,2914,63,...,868,744,6455,67,0,9050,16551,4679,9499,33.001834
6,2004,Egypt,Sudan,EGY,SDN,1259,1084,929,4384,80,...,1251,1071,11397,71,0,15290,23026,7094,15932,30.808651
8,2005,Egypt,Sudan,EGY,SDN,1368,1098,942,4563,90,...,1264,1083,11535,72,0,15576,23637,7377,16260,31.209544

In [102]:
egyptoverall['Total Children'] = egyptoverall[childgroups].sum(axis=1)

In [104]:
egyptoverall['Total Adults'] = egyptoverall[adultgroups].sum(axis=1)

In [106]:
egyptoverall['Child %'] = (egyptoverall['Total Children'] / (egyptoverall['Total Children'] + egyptoverall['Total Adults'])) * 100

In [365]:
egyptoverall.head()

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Female 0 - 4,Female 5 - 11,Female 12 - 17,Female 18 - 59,Female 60+,...,Male 5 - 11,Male 12 - 17,Male 18 - 59,Male 60+,Male Other,Male Total,Total,Total Children,Total Adults,Child %
0,2001,Egypt,Sudan,EGY,SDN,302,331,283,1035,38,...,393,336,1571,32,7624,10294,15952,1983,2676,42.562782
2,2002,Egypt,Sudan,EGY,SDN,477,473,405,1702,42,...,556,476,2910,40,0,4530,15033,2935,4694,38.471621
4,2003,Egypt,Sudan,EGY,SDN,765,746,640,2914,63,...,868,744,6455,67,0,9050,16551,4679,9499,33.001834
6,2004,Egypt,Sudan,EGY,SDN,1259,1084,929,4384,80,...,1251,1071,11397,71,0,15290,23026,7094,15932,30.808651
8,2005,Egypt,Sudan,EGY,SDN,1368,1098,942,4563,90,...,1264,1083,11535,72,0,15576,23637,7377,16260,31.209544

###plot a grid

In [108]:
overallcomp = egyptoverall.pivot_table(columns='Country of Origin', values='Child %', index='Year')

In [109]:
overallcomp

Country of Origin  South Sudan      Sudan
Year
2001                       NaN  42.562782
2002                       NaN  38.471621
2003                       NaN  33.001834
2004                       NaN  30.808651
2005                       NaN  31.209544
2006                       NaN  31.226193
2007                       NaN  31.068493
2008                       NaN  31.662586
2009                       NaN  31.781488
2010                       NaN  32.419706
2011                       NaN  33.729293
2012                 47.027601  39.121467
2013                 51.073198  37.690706
2014                 76.503822  80.626333
2015                 51.827645  39.584790
2016                 49.920227  39.963173
2017                 45.627792  39.992165
2018                 44.446724  39.288023
2019                 44.111923  40.696774
2020                 42.822520  39.751061
2021                 42.958528  40.130377
2022                 43.296640  43.614884
2023                 42.637479  40.977131
2024                 44.624483  40.312128

In [187]:
sudan_df.to_csv('USAdFinal.csv', index=False)

In [197]:
pocd.to_csv('Demo.csv', index=False)

In [191]:
pocd['Total Children'] = pocd[childgroups].sum(axis=1)

In [193]:
pocd['Total Adults'] = pocd[adultgroups].sum(axis=1)

In [195]:
pocd['Child %'] = (pocd['Total Children'] / (pocd['Total Children'] + pocd['Total Adults'])) * 100